REVIEW_ONE = 'Разрешён только один отзыв на произведение'
REVIEW_SCORE = 'Возможны оценки только от 1 до 10'

TITLE_YEAR_FROM_FUTURE = 'Год слишком далеко в будущем'

USER_NAME_NOT_ME = 'Использовать имя «me» запрещено'
USER_NAME_TEMPLATE = (
    'Имя пользователя не соответствует шаблону,'
    'используйте буквы и цифры, не используйте символы . @ + -'
)
USER_EMAIL_UNIQUE = 'С данным email пользователь зарегистрирован!'
USER_USERNAME_UNIQUE = 'С данным именем пользователь зарегистрирован!'

PERMISSION_ADMIN_USE = 'Пользоваться может только администратор'
PERMISSION_ADMIN_EDIT = 'Редактировать может только администратор'
PERMISSION_EDIT = (
    'Редактировать может только автор, модератор или администратор'
)

EMAIL_CONF_CODE_SUBJECT = 'Регистрация пользователя'
EMAIL_CONF_CODE_MESSAGE = 'Добрый день!\n\nВаш код подтверждения: '
