REVIEW_ONE = 'Разрешён только один отзыв на произведение'
REVIEW_SCORE = 'Возможны оценки только от 1 до 10'

TITLE_YEAR_FROM_FUTURE = 'Год слишком далеко в будущем'

USER_NAME_NOT_ME = 'Использовать имя «me» запрещено'
USER_NAME_TEMPLATE = 'Имя не соответствует шаблону, ' \
                     'разрешено использовать символы и цифры кроме: .@+-'
USER_EMAIL_UNIQUE = 'Email и Username должны быть уникальные'

PERMISSION_ADMIN_USE = 'Пользоваться может только администратор'
PERMISSION_ADMIN_EDIT = 'Редактировать может только администратор'
PERMISSION_EDIT = (
    'Редактировать может только автор, модератор или администратор'
)

URLS_ME = 'me'
